// Notifications
"MESSAGE_TEXT" = "%1$@: %2$@";
"MESSAGE_NOTEXT" = "%1$@ 给你发送了一条消息";
"MESSAGE_PHOTO" = "%1$@ 给你发送了一张图片";
"MESSAGE_VIDEO" = "%1$@ 给你发送了一段视频";
"MESSAGE_CONTACT" = "%1$@ 给你分享了一个联系人";
"MESSAGE_GEO" = "%1$@ 给你发送了一个位置";
"MESSAGE_DOC" = "%1$@ 给你发送了一个文件";
"MESSAGE_AUDIO" = "%1$@ 给你发送了一段音频";
"ENCRYPTED_MESSAGE" = "你收到了一条新消息%1$@";

"ENCRYPTION_REQUEST" = "新的加密请求%1$@";
"ENCRYPTION_ACCEPT" = "您的加密请求已被接受%1$@";
"DC_UPDATE" = "打开此通知以更新 App 设置";

"CHAT_MESSAGE_TEXT" = "%1$@@%2$@: %3$@";
"CHAT_MESSAGE_NOTEXT" = "%1$@ 发送了一条消息到群组 %2$@";
"CHAT_MESSAGE_PHOTO" = "%1$@ 发送了一张图片到群组 %2$@";
"CHAT_MESSAGE_VIDEO" = "%1$@ 发送了一段视频到群组 %2$@";
"CHAT_MESSAGE_CONTACT" = "%1$@ 在群组 %2$@ 中分享了内容";
"CHAT_MESSAGE_GEO" = "%1$@ 发送了位置到群组 %2$@";
"CHAT_MESSAGE_DOC" = "%1$@ 发送了一个文件到群组 %2$@";
"CHAT_MESSAGE_AUDIO" = "%1$@ 发送了一段音频到群组 %2$@";
"CHAT_CREATED" = "%1$@ 邀请你加入群组 %2$@";
"CHAT_TITLE_EDITED" = "%1$@ 编辑了群组 %2$@ 的名字";
"CHAT_PHOTO_EDITED" = "%1$@ 编辑了群组 %2$@ 的头像";
"CHAT_ADD_MEMBER" = "%1$@ 邀请了 %3$@ 加入群组 %2$@";
"CHAT_ADD_YOU" = "%1$@ 邀请你加入群组 %2$@";
"CHAT_DELETE_YOU" = "%1$@ 已将你从群组 %2$@ 中移出";
"CHAT_DELETE_MEMBER" = "%1$@ 已将 %3$@ 从群组 %2$@ 中移出";
"CHAT_LEFT" = "%1$@ 离开了群组 %2$@";
"CHAT_RETURNED" = "%1$@ 回到了群组 %2$@";

"MESSAGE_STICKER" = "%1$@ 给你发送了一个贴图";
"CHAT_MESSAGE_STICKER" = "%1$@ 发送了一个贴图到群组 %2$@";

"CONTACT_JOINED" = "%1$@ 加入了 Telegram ！";
"CONTACT_ACTIVATED" = "%1$@ 帮助您激活了帐号！";

"AUTH_UNKNOWN" = "在新设备上登录 %1$@";
"AUTH_REGION" = "在新设备上登录 %1$@, 位置: %2$@";

// Common
"Common.OK" = "好";
"Common.Cancel" = "取消";
"Common.Edit" = "编辑";
"Common.edit" = "编辑";
"Common.Done" = "完成";
"Common.Next" = "继续";
"Common.Delete" = "删除";
"Common.Create" = "创建";
"Common.Back" = "返回";
"Common.Close" = "关闭";
"Common.Yes" = "是";
"Common.No" = "否";
"Common.TakePhotoOrVideo" = "拍摄照片/视频";
"Common.TakePhoto" = "拍照";
"Common.ChoosePhoto" = "选择照片";
"Common.ChooseVideo" = "选择视频";
"Common.of" = "的";
"Common.Search" = "搜索";
"Common.More" = "更多";

// State
"State.connecting" = "连接中";
"State.updating" = "收取中";
"State.Connecting" = "连接中...";
"State.Updating" = "收取中...";
"State.WaitingForNetwork" = "等待网络连接";

// Presence
"Presence.online" = "在线";
"Presence.offline" = "离线";
"Presence.invisible" = "不可见";

// Date
"Month.GenJanuary" = "一月";
"Month.GenFebruary" = "二月";
"Month.GenMarch" = "三月";
"Month.GenApril" = "四月";
"Month.GenMay" = "五月";
"Month.GenJune" = "六月";
"Month.GenJuly" = "七月";
"Month.GenAugust" = "八月";
"Month.GenSeptember" = "九月";
"Month.GenOctober" = "十月";
"Month.GenNovember" = "十一月";
"Month.GenDecember" = "十二月";
"Month.ShortJanuary" = "1月";
"Month.ShortFebruary" = "2月";
"Month.ShortMarch" = "3月";
"Month.ShortApril" = "4月";
"Month.ShortMay" = "5月";
"Month.ShortJune" = "6月";
"Month.ShortJuly" = "7月";
"Month.ShortAugust" = "8月";
"Month.ShortSeptember" = "9月";
"Month.ShortOctober" = "10月";
"Month.ShortNovember" = "11月";
"Month.ShortDecember" = "12月";
"Weekday.ShortMonday" = "周一";
"Weekday.ShortTuesday" = "周二";
"Weekday.ShortWednesday" = "周三";
"Weekday.ShortThursday" = "周四";
"Weekday.ShortFriday" = "周五";
"Weekday.ShortSaturday" = "周六";
"Weekday.ShortSunday" = "周日";
"Weekday.Monday" = "星期一";
"Weekday.Tuesday" = "星期二";
"Weekday.Wednesday" = "星期三";
"Weekday.Thursday" = "星期四";
"Weekday.Friday" = "星期五";
"Weekday.Saturday" = "星期六";
"Weekday.Sunday" = "星期天";

"Time.TodayAt" = "今天 %@";
"Time.YesterdayAt" = "昨天 %@";

"LastSeen.JustNow" = "上次上线 刚刚";
"LastSeen.MinutesAgo_1" = "上次上线于 1 分钟以前";
"LastSeen.MinutesAgo_2" = "上次上线于 2 分钟以前";
"LastSeen.MinutesAgo_3_10" = "上次上线于 %@ 分钟以前";
"LastSeen.MinutesAgo_any" = "上次上线于 %@ 分钟以前";
"LastSeen.HoursAgo_1" = "上次上线于 1小时以前";
"LastSeen.HoursAgo_2" = "上次上线于 2小时时以前";
"LastSeen.HoursAgo_3_10" = "上次上线于 %@ 小时以前";
"LastSeen.HoursAgo_any" = "上次上线于 %@ 小时以前";
"LastSeen.TodayAt" = "上次上线于 今天%@";
"LastSeen.YesterdayAt" = "上次上线于 昨天%@";
"LastSeen.AtWeekday" = "上次上线于 %@";
"LastSeen.AtDate" = "上次上线于 %@";
"LastSeen.Lately" = "最近上线过";
"LastSeen.WithinAWeek" = "上次上线于 一周内";
"LastSeen.WithinAMonth" = "上次上线于 一个月内";
"LastSeen.ALongTimeAgo" = "很久以前上线过";

"Date.DialogDateFormat" = "{month}{day}日";

// Tour
"Tour.Title1" = "Telegram";
"Tour.Text1" = "世界上 **最快的** 聊天工具\n**免费**且**安全**";

"Tour.Title2" = "快速";
"Tour.Text2" = "**Telegram** 以同类软件中最快的速度\n为您传递消息。";

"Tour.Title3" = "强大";
"Tour.Text3" = "**Telegram** 没有大小限制\n不论消息或是媒体文件。";

"Tour.Title4" = "安全";
"Tour.Text4" = "**Telegram** 保证您的消息安全\n不受黑客侵扰。";

"Tour.Title5" = "云端";
"Tour.Text5" = "**Telegram** 允许您通过多个设备访问您的\n聊天记录。";

"Tour.Title6" = "免费";
"Tour.Text6" = "**Telegram** 永久免费，并且没有广告。\n没有订购费用。";

"Tour.Title7" = "隐私";
"Tour.Text7" = "**Telegram** 消息全部重度加密并且能够自我销毁。";

"Tour.StartButton" = "开始使用";

// Login
"Login.PhoneAndCountryHelp" = "请确认您的国家代码并输入您的手机号";
"Login.CodeHelp" = "我们已经向您的手机 \n%@ 发送了一条带有验证码的短信";
"Login.CodeSentInternal" = "请在输入您在已登录的 **Telegram** App 中收到的验证码";
"Login.HaveNotReceivedCodeInternal" = "没有收到验证码？";
"Login.CodeSentSms" = "我们向您发送了一条带有验证码的短信。";
"Login.Code" = "验证码";
"Login.CallRequestState1" = "Telegram 将会在 %d:%.2d 内呼叫您的手机";
"Login.CallRequestState2" = "正在向 Telegram 发送呼叫请求...";
"Login.CallRequestState3" = "Telegram 呼叫了您的手机\n[没有得到验证码？]";
"Login.EmailNotConfiguredError" = "请先设置一个邮箱帐号";
"Login.EmailCodeSubject" = "%@, no code";
"Login.EmailCodeBody" = "My phone number is:\n%@\nI can't get an activation code for Telegram.";
"Login.UnknownError" = "呃，出错了，请稍候再试";
"Login.InvalidCodeError" = "验证码错误，请重新输入";
"Login.NetworkError" = "请检查您的网络连接然后再试一次";
"Login.CodeExpiredError" = "验证码过期，请重试";
"Login.CodeFloodError" = "已达到错误次数上线，请稍后再试";
"Login.InvalidPhoneError" = "手机号无效，请重新输入";
"Login.InvalidFirstNameError" = "无效的姓，请重新输入";
"Login.InvalidLastNameError" = "无效的名，请重新输入";
"Login.InactiveHelp" = "您还没有任何联系人\n正在使用 Telegram\n我们将会在他们加入 Telegram 后通知您\n您也可以立刻邀请你的朋友加入。";
"Login.InviteButton" = "邀请朋友加入聊天";

"Login.PhoneTitle" = "您的手机号";
"Login.PhonePlaceholder" = "手机号";
"Login.CountryCode" = "国家代码";
"Login.InvalidCountryCode" = "国家代码无效";

"Login.CodeTitle" = "验证码";

"Login.InfoTitle" = "您的信息";
"Login.InfoAvatarAdd" = "上传";
"Login.InfoAvatarPhoto" = "头像";
"Login.InfoFirstNamePlaceholder" = "名称";
"Login.InfoLastNamePlaceholder" = "姓氏";
"Login.InfoUpdatePhoto" = "上传头像";
"Login.InfoDeletePhoto" = "删除头像";
"Login.InfoHelp" = "输入您的姓名并添加头像。\n\n请尽量使用英文名称，因为 Telegram 会默认将姓氏置后并加粗显示。（译者注）";

// Login.SelectCountry
"Login.SelectCountry.Title" = "国家";

// Welcome Screen
"WelcomeScreen.Title" = "立刻开始";
"WelcomeScreen.Logout" = "注销";
"WelcomeScreen.Greeting" = "欢迎, %@!";
"WelcomeScreen.ContactsAccessDisabled" = "抱歉，暂时无法同步您的联系人。";
"WelcomeScreen.ContactsAccessHelp" = "Telegram 基于您已经存在的联系人工作。请前往 设置 > 隐私 > 通讯录 打开 Telegram 的开关。";
"WelcomeScreen.ContactsAccessSettings" = "设置";
"WelcomeScreen.UpdatingTitle" = "更新中...";

// Dialog List
"DialogList.TabTitle" = "会话";
"DialogList.Title" = "会话";
"DialogList.SearchLabel" = "搜索";
"DialogList.SelectContact" = "选择联系人";
"DialogList.SelectContacts" = "选择联系人";
"DialogList.Create" = "创建";
"DialogList.NoMessagesTitle" = "您还没有开始任何会话";
"DialogList.NoMessagesText" = "点按右上角的铅笔图标来选择联系人开始聊天。";
"DialogList.SingleTypingSuffix" = "%@ 正在输入";
"DialogList.MultipleTypingSuffix" = "%d 正在输入";
"DialogList.Typing" = "正在输入";
"DialogList.ClearHistoryConfirmation" = "清除聊天记录";
"DialogList.DeleteConversationConfirmation" = "删除并退出";
"DialogList.AwaitingEncryption" = "等待 %@ 上线...";
"DialogList.EncryptionRejected" = "Secret chat cancelled";
"DialogList.EncryptionProcessing" = "正在交换加密密钥...";
"DialogList.EncryptedChatStartedOutgoing" = "%@ 加入了你的私密会话。";
"DialogList.EncryptedChatStartedIncoming" = "%@ 创建了私密会话。";
"DialogList.Conversations" = "会话";
"DialogList.Messages" = "消息";

// Compose
"Compose.TokenListPlaceholder" = "您希望给谁发送消息？";
"Compose.NewMessage" = "新建会话";
"Compose.NewGroup" = "新建群组";
"Compose.NewEncryptedChat" = "新建私密会话";
"Compose.NewBroadcast" = "广播列表";
"Compose.NewBroadcastButton" = "新建广播";
"Compose.Recipients" = "接受者";
"Compose.Create" = "创建";

// Contacts
"Contacts.TabTitle" = "联系人";
"Contacts.Title" = "联系人";
"Contacts.Invite" = "邀请";
"Contacts.contact" = "联系人";
"Contacts.contacts" = "联系人";
"Contacts.contactsvar" = "联系人";
"Contacts.InvitationText" = "嗨, 我们换到 Telegram（http://telegram.org/dl）聊吧";
"Contacts.FailedToSendInvitesMessage" = "呃，出错了。";
"Contacts.AccessDeniedError" = "Telegram 无法访问您的通讯录";
"Contacts.AccessDeniedHelpLandscape" = "请前往你的 %@ 设置 — 隐私 — 通讯录.\n然后打开 Telegram 的开关。";
"Contacts.AccessDeniedHelpPortrait" = "请前往你的 %@ 设置 — 隐私 — 通讯录. 然后打开 Telegram 的开关。";
"Contacts.AccessDeniedHelpON" = "开";
"Contacts.InviteToTelegram" = "邀请到 Telegram";
"Contacts.InviteFriends" = "邀请好友";
"Contacts.SelectAll" = "全选";

// Conversation
"Conversation.InputTextPlaceholder" = "发送消息...";
"Conversation.Send" = "发送";
"Conversation.typing" = "正在输入";
"Conversation.MessageDeliveryFailed" = "您的消息没有成功发送，点击 \"重新发送\" 来再次尝试发送。";
"Conversation.MessageDialogEdit" = "编辑";
"Conversation.MessageDialogRetry" = "重新发送";
"Conversation.MessageDialogRetryAll" = "重新发送 %1$d 条消息";
"Conversation.MessageDialogDelete" = "删除";
"Conversation.LinkDialogOpen" = "打开";
"Conversation.LinkDialogCopy" = "拷贝";
"Conversation.EditDelete" = "删除";
"Conversation.EditForward" = "转发";
"Conversation.ForwardToPersonFormat" = "转发给 %@?";
"Conversation.ForwardToGroupFormat" = "转发给 %@?";
"Conversation.ForwardTitle" = "转发";
"Conversation.ForwardChats" = "会话";
"Conversation.ForwardContacts" = "联系人";
"Conversation.StatusKickedFromGroup" = "您从群组中被移出了";
"Conversation.StatusLeftGroup" = "你离开了群组";
"Conversation.StatusTyping" = "正在输入";
"Conversation.BroadcastTitle" = "广播";
"Conversation.Call" = "呼叫";
"Conversation.Mute" = "静音";
"Conversation.Unmute" = "取消静音";
"Conversation.Edit" = "编辑";
"Conversation.Info" = "联系人信息";
"Conversation.Block" = "屏蔽";
"Conversation.Unblock" = "取消屏蔽";
"Conversation.ClearAll" = "全部删除";
"Conversation.Location" = "位置";
"Conversation.Document" = "发送文件";
"Conversation.Contact" = "联系人";
"Conversation.BlockUser" = "屏蔽此用户";
"Conversation.UnblockUser" = "取消对此用户的屏蔽";
"Conversation.DeleteGroup" = "删除此群组";
"Conversation.DeleteChat" = "删除此会话";
"Conversation.ClearAllConfirmation" = "删除所有历史记录？";
"Conversation.SearchImages" = "搜索图片";
"Conversation.UnsupportedMedia" = "您的版本过旧，无法查看这条消息。 请前往这里升级：\nhttp://telegram.org/update";
"Conversation.EncryptionWaiting" = "等待 %@ 上线...";
"Conversation.EncryptionProcessing" = "正在交换加密密钥...";
"Conversation.SupportPlaceholder" = "对 Telegram 有任何疑问？";
"Conversation.EmptyPlaceholder" = "这里暂时还没有消息...";
"Conversation.EncryptedPlaceholderTitleIncoming" = "%@ 邀请您加入私密会话";
"Conversation.EncryptedPlaceholderTitleOutgoing" = "您邀请了 %@ 加入到私密会话";
"Conversation.EncryptedDescriptionTitle" = "私密会话:";
"Conversation.EncryptedDescription1" = "使用端到端加密";
"Conversation.EncryptedDescription2" = "不在我们的服务器上留下任何痕迹";
"Conversation.EncryptedDescription3" = "支持消息自我销毁";
"Conversation.EncryptedDescription4" = "不允许转发消息";
"Conversation.EncryptedForwardingAlert" = "抱歉，在私密会话中不能转发消息。";
"Conversation.ContextMenuCopy" = "拷贝";
"Conversation.ContextMenuDelete" = "删除";
"Conversation.ContextMenuForward" = "转发";
"Conversation.ContextMenuMore" = "更多...";

"Conversation.StatusMembers_1" = "1 个成员";
"Conversation.StatusMembers_2" = "2 个成员";
"Conversation.StatusMembers_3_10" = "%@ 个成员";
"Conversation.StatusMembers_any" = "%@ 个成员";

"Conversation.StatusRecipients_1" = "1 个接受者";
"Conversation.StatusRecipients_2" = "2 个接受者";
"Conversation.StatusRecipients_3_10" = "%@ 个接受者";
"Conversation.StatusRecipients_any" = "%@ 个接受者";

"Conversation.StatusOnline_1" = "1 人在线";
"Conversation.StatusOnline_2" = "2 人在线";
"Conversation.StatusOnline_3_10" = "%@ 人在线"; 
"Conversation.StatusOnline_any" = "%@ 人在线";

"Conversation.UnreadMessages" = "未读消息";
"Conversation.InfoGroup" = "群组";
"Conversation.InfoPrivate" = "联系人";
"Conversation.InfoBroadcastList" = "列表";

// Notification
"Notification.RenamedChat" = "%@ 重命名了群组";
"Notification.ChangedGroupPhoto" = "%@ 修改了群组头像";
"Notification.RemovedGroupPhoto" = "%@ 删除了群组头像";
"Notification.ChangedUserPhoto" = "%@ 添加了新的头像";
"Notification.RemovedUserPhoto" = "%@ 删除了头像";
"Notification.JoinedChat" = "%@ 加入了群组";
"Notification.Invited" = "%@ 邀请了 %@";
"Notification.LeftChat" = "%@ 离开了群组";
"Notification.Kicked" = "%@ 移出了 %@";
"Notification.CreatedChat" = "%@ 创建了群组";
"Notification.CreatedBroadcastList" = "你创建了广播列表";
"Notification.CreatedChatWithTitle" = "%@ 创建了群组 \"%@\"";
"Notification.Joined" = "%@ 加入了 Telegram";
"Notification.ChangedGroupName" = "%@ 将群组名称修改为了 \"%@\"";

"Notification.NewAuthDetected" = "%1$@,\n我们于 %3$@，%2$@ %4$@发现一个新设备登录到您的帐号\n\设备: %5$@\位置: %6$@\n\n如果这不是您本人, 您可以前往设置  — 隐私与安全 点击 吊销所有登录凭据\n\n谢谢,\nTelegram 团队";

"Notification.EncryptedChatRequested" = "已发送私密会话请求";
"Notification.EncryptedChatAccepted" = "私密会话开始";
"Notification.MessageLifetimeChanged" = "%1$@ 将消息自毁倒计时设为了 %2$@";
"Notification.MessageLifetimeChangedOutgoing" = "你将消息自毁设为了 %1$@";
"Notification.MessageLifetimeRemoved" = "%1$@ 关闭了消息自毁";
"Notification.MessageLifetimeRemovedOutgoing" = "关闭用了消息自毁";
"Notification.MessageLifetime2s" = "2 秒";
"Notification.MessageLifetime5s" = "5 秒";
"Notification.MessageLifetime1m" = "1 分钟";
"Notification.MessageLifetime1h" = "1 小时";
"Notification.MessageLifetime1d" = "1 天";
"Notification.MessageLifetime1w" = "1 周";

// Message
"Message.Photo" = "照片";
"Message.Video" = "视频";
"Message.Location" = "位置";
"Message.Contact" = "联系人";
"Message.File" = "文件";
"Message.Sticker" = "表情";
"Message.Audio" = "音频";
"Message.ForwardedMessage" = "转发的消息\n来自: %@";
"Message.SharedContact" = "分享联系人";

// Conversation Profile
"ConversationProfile.ErrorCreatingConversation" = "呃，出错了..";
"ConversationProfile.UserLeftChatError" = "抱歉, %@ 已经决定离开此群组，您无法邀请他回来。";
"ConversationProfile.UnknownAddMemberError" = "遇到了一个没有预料到的问题，我们的魔法程序员已经收到了错误并且将会尽快修正咒语";
"ConversationProfile.UsersTooMuchError" = "抱歉，这个群组已经满员。 您无法添加更多人到这里了。";
"ConversationProfile.LeaveDeleteAndExit" = "删除并退出";
"Conversation.DownloadPhoto" = "下载照片";
"Conversation.ViewPhoto" = "查看照片";
"Conversation.PlayVideo" = "播放视频";
"Conversation.Play" = "播放";
"Conversation.Stop" = "停止";
"Conversation.ViewFile" = "查看文件";
"Conversation.Download" = "下载";
"Conversation.DownloadMegabytes" = "下载 %.1fMb";
"Conversation.DownloadKilobytes" = "下载 %dKb";
"Conversation.Megabytes" = "%.1fMb";
"Conversation.Kilobytes" = "%dKb";
"Conversation.DownloadProgressMegabytes" = "%1$.1fMb / %2$.1fMb";
"Conversation.DownloadProgressKilobytes" = "%1$dKb / %2$dKb";
"Conversation.ViewLocation" = "查看位置";
"Conversation.SearchWebImages" = "查找图片";
"Conversation.ShareMyContactInfo" = "分享我的联系信息";
"Conversation.AddContact" = "添加联系人";
"Conversation.SendMessage" = "发送消息";
"Conversation.EncryptionCanceled" = "私密会话已取消";
"Conversation.DeleteOneMessage" = "删除此消息";
"Conversation.DeleteManyMessages" = "删除选中的消息";
"Conversation.View" = "查看";
"Conversation.Download" = "下载";
"Conversation.SlideToCancel" = "左划来取消发送";
"Conversation.ApplyLocalization" = "使用此本地化文件";
"Conversation.OpenFile" = "打开文件";
"Conversation.MicrophoneAccessDisabled" = "Telegram 需要访问您麦克风的权限来录制音频消息。 请前往设置 - 隐私 - 麦克风 然后打开 Telegram 的开关。";

// Media Picker
"MediaPicker.Send" = "发送";
"MediaPicker.Choose" = "选择";
"SearchImages.SearchImages" = "搜索图片";
"SearchImages.Title" = "相册";
"MediaPicker.CameraRoll" = "相机胶卷";
"SearchImages.NoImagesFound" = "没有找到图片";
"MediaPicker.AccessDeniedError" = "Telegram 没有访问您照片的权限。";
"MediaPicker.AccessDeniedHelp" = "请前往您的 %@ 设置 — 隐私 — 照片.\n然后打开 Telegram 的开关。";
"SearchImages.Downloading#Kb" = "下载中 %d Kb";
"SearchImages.Downloading#Mb" = "下载中 %d Mb";
"SearchImages.ImageNofM" = "图片 %2$@ 中的 %1$@";
"SearchImages.DownloadCancelled" = "下载已取消";
"SearchImages.ErrorDownloadingImage" = "下载图片出错";
"SearchImages.SkipImage" = "跳过此图片";
"SearchImages.RetryDownload" = "再次尝试";

// User Profile
"Profile.ImageUploadError" = "呃，出错了。 请稍后再试。";
"Profile.PhonebookAccessDisabled" = "要使用此功能，请前往您 iPhone 的 设置 — 隐私 — 通讯录 然后打开 Telegram 的开关。";
"Profile.CreateEncryptedChatError" = "呃，出错了";
"Profile.CreateEncryptedChatOutdatedError" = "无法创建与 %@ 的私密会话，\n%@ 使用的软件版本过低，请先升级。";
"Profile.CreateNewContact" = "新建联系人";
"Profile.AddToExisting" = "添加到已存在的联系人";
"Profile.EncryptionKey" = "加密密钥";
"Profile.MessageLifetime" = "消息自毁倒计时";
"Profile.MessageLifetimeForever" = "关闭";
"Profile.MessageLifetime2s" = "2秒";
"Profile.MessageLifetime5s" = "5秒";
"Profile.MessageLifetime1m" = "1分钟";
"Profile.MessageLifetime1h" = "1小时";
"Profile.MessageLifetime1d" = "1天";
"Profile.MessageLifetime1w" = "1周";
"Profile.ShareContactButton" = "分享此联系人";
"Profile.ShareContactPersonFormat" = "分享给 %@？";
"Profile.ShareContactGroupFormat" = "分享给 %@？";

// User Info
"UserInfo.Title" = "联系人信息";
"UserInfo.FirstNamePlaceholder" = "名字";
"UserInfo.LastNamePlaceholder" = "姓氏";
"UserInfo.GenericPhoneLabel" = "手机";
"UserInfo.SendMessage" = "发送消息";
"UserInfo.AddContact" = "添加为联系人";
"UserInfo.ShareContact" = "分享此联系人";
"UserInfo.StartSecretChat" = "开始私密会话";
"UserInfo.DeleteContact" = "删除联系人";
"UserInfo.CreateNewContact" = "创建新的联系人";
"UserInfo.AddToExisting" = "添加到已存在的联系人";
"UserInfo.AddPhone" = "添加电话";
"UserInfo.NotificationsEnabled" = "已开启";
"UserInfo.NotificationsDisabled" = "已关闭";
"UserInfo.NotificationsEnable" = "开启";
"UserInfo.NotificationsDisable" = "关闭";
"UserInfo.Invite" = "邀请到 Telegram";

// New Contact
"NewContact.Title" = "新建联系人";

// Phone Label
"PhoneLabel.Title" = "Label";

// Secret Chat
"SecretChat.Title" = "私密会话";

// Group Info
"GroupInfo.Title" = "群组信息";
"GroupInfo.GroupNamePlaceholder" = "群组名称";
"GroupInfo.BroadcastListNamePlaceholder" = "列表名称";
"GroupInfo.SetGroupPhoto" = "设置群组头像";
"GroupInfo.SetGroupPhotoStop" = "停止";
"GroupInfo.SetGroupPhotoDelete" = "删除群组头像";
"GroupInfo.Notifications" = "推送通知";
"GroupInfo.Sound" = "声音";
"GroupInfo.SharedMedia" = "分享的媒体";
"GroupInfo.SharedMediaNone" = "无";
"GroupInfo.DeleteAndExit" = "删除并退出";
"GroupInfo.DeleteAndExitConfirmation" = "您将无法再次加入此群组";
"GroupInfo.ParticipantCount_1" = "1 位参与者";
"GroupInfo.ParticipantCount_2" = "2 位参与者";
"GroupInfo.ParticipantCount_3_10" = "%@ 位参与者";
"GroupInfo.ParticipantCount_any" = "%@ 位参与者";
"GroupInfo.AddParticipant" = "添加参与者...";
"GroupInfo.AddParticipantTitle" = "联系人";
"GroupInfo.AddParticipantConfirmation" = "添加 %@ 到这个群组？";
"GroupInfo.KickedStatus" = "你从群组中被移出了";
"GroupInfo.LeftStatus" = "你离开了群组";

// Encryption Key
"EncryptionKey.Title" = "加密密钥";
"EncryptionKey.Description" = "这是您与 %1$@ 私密会话加密密钥的可视化图片。\n\n如果这张图片看起来和 %2$@ 设备上看起来的图片完全一样的话，您和对方的会话是 200%% 安全的。\n\n更多详情请参考 telegram.org";

// Conversation media
"ConversationMedia.Title" = "媒体";
"ConversationMedia.EmptyTitle" = "没有任何照片或视频";

// Preview
"Preview.VideoNotYetDownloaded" = "先下载视频";
"Preview.GroupPhotoTitle" = "群组头像";
"Preview.ProfilePhotoTitle" = "头像";
"Preview.LoadingVideo" = "加载视频...";
"Preview.LoadingImage" = "加载大图...";
"Preview.LoadingImages" = "加载大图...";
"Preview.DeletePhoto" = "删除图片";
"Preview.DeleteVideo" = "删除视频";
"Preview.ForwardViaTelegram" = "通过 Telegram 转发";
"Preview.SaveToCameraRoll" = "保存到相机胶卷";

// Map
"Map.ChooseLocationTitle" = "位置";
"Map.MapTitle" = "地图";
"Map.Send" = "发送";
"Map.Map" = "地图";
"Map.Satellite" = "卫星";
"Map.Hybrid" = "混合";
"Map.AccessDeniedError" = "要使用此功能，请前往您 iPhone 的 设置 — 隐私 — 定位服务 然后打开 Telegram 的开关。";
"Map.ForwardViaTelegram" = "通过 Telegram 转发";
"Map.GetDirections" = "获取位置";
"Map.OpenInGoogleMaps" = "在 Google Maps 中打开";

// Web
"Web.Error" = "无法加载网页";
"Web.OpenExternal" = "在 Safari 中打开";
"Web.CopyLink" = "拷贝链接";

// Document
"Document.TargetConfirmationFormat" = "发送文件 ({size}) 给 {target}？";

// Dialog List
"DialogList.You" = "你";

// Settings
"Settings.TabTitle" = "设置";
"Settings.SetProfilePhoto" = "上传头像";
"Settings.Logout" = "注销";
"Settings.Title" = "设置";
"Settings.NotificationsAndSounds" = "通知与声音";
"Settings.ChatSettings" = "会话设置";
"Settings.BlockedUsers" = "已屏蔽的用户";
"Settings.ChatBackground" = "聊天背景";
"Settings.Support" = "咨询问题";
"Settings.FAQ" = "Telegram FAQ";
"Settings.FAQ_URL" = "http://telegram.org/faq#general";
"Settings.FAQ_Intro" = "请注意 Telegram 的支持服务来自自愿者，反馈时请使用英文。我们将尽量尝试快速回复，但是这仍然会花一点时间。请前往 Telegram FAQ（英文） 看看: 那里有各种常见问题和故障排除提示。";
"Settings.FAQ_Button" = "FAQ";
"Settings.SaveIncomingPhotos" = "自动保存图片";
"Settings.SaveIncomingPhotosHelp" = "自动将图片保存到相机胶卷。";
"Settings.LogoutError" = "呃，出错了。请稍后再试...";

// Notifications and Sounds
"Notifications.Title" = "通知";
"Notifications.MessageNotifications" = "消息通知";
"Notifications.MessageNotificationsAlert" = "Alert";
"Notifications.MessageNotificationsPreview" = "Message Preview";
"Notifications.MessageNotificationsSound" = "Sound";
"Notifications.MessageNotificationsHelp" = "You can set custom notifications for specific users on their Info page.";

"Notifications.GroupNotifications" = "群组消息通知";
"Notifications.GroupNotificationsAlert" = "警告";
"Notifications.GroupNotificationsPreview" = "消息预览";
"Notifications.GroupNotificationsSound" = "声音";
"Notifications.GroupNotificationsHelp" = "您可以在特定的群组信息中设置针对他们的通知策略。";

"Notifications.TextTone" = "提醒声音";
"Notifications.AlertTones" = "提醒铃声";
"Notifications.ClassicTones" = "经典";

"Notifications.InAppNotifications" = "App 内通知";
"Notifications.InAppNotificationsSounds" = "App 内播放提醒音";
"Notifications.InAppNotificationsVibrate" = "App 内振动提醒";
"Notifications.InAppNotificationsPreview" = "App 内消息预览";

"Notifications.Reset" = "重设";
"Notifications.ResetAllNotifications" = "重设所有通知选项";
"Notifications.ResetAllNotificationsHelp" = "将您所有针对特定群组/联系人的通知策略恢复为默认";

// Chat Settings
"ChatSettings.Title" = "会话设置";
"ChatSettings.Appearance" = "显示效果";
"ChatSettings.TextSize" = "字号";
"ChatSettings.TextSizeUnits" = "pt";
"ChatSettings.AutomaticPhotoDownload" = "自动下载音频";
"ChatSettings.AutomaticAudioDownload" = "自动下载视频";
"ChatSettings.PrivateChats" = "普通会话";
"ChatSettings.Groups" = "群组";
"ChatSettings.Security" = "安全";
"ChatSettings.ClearOtherSessions" = "吊销所有其他登录凭据";
"ChatSettings.ClearOtherSessionsHelp" = "注销所有其他设备的登录";
"ChatSettings.ClearOtherSessionsConfirmation" = "您确定您要将除此设备之外的所有其他设备注销？";
"ChatSettings.ClearOtherSessionsFailed" = "呃，出错了。";
"ChatSettings.Language" = "语言";
"ChatSettings.RevertLanguage" = "恢复语言设置";
"ChatSettings.Cache" = "缓存";

// Usage
"Cache.Title" = "缓存设置";
"Cache.ClearCache" = "清除所有缓存";
"Cache.KeepMedia" = "保留媒体文件";
"Cache.Help" = "照片，视频以及其他来自云端的各种文件，在此期限之内**没有**被访问的 都会被删除以节省您设备的空间。\n\n所有保存在 Telegram 云端的媒体您都可以随时在需要的时候重新下载。";

// Blocked Users
"BlockedUsers.Title" = "屏蔽的用户";
"BlockedUsers.SelectUserTitle" = "屏蔽";
"BlockedUsers.AlreadyBlocked" = "此人已经被屏蔽了。";
"BlockedUsers.BlockUser" = "屏蔽用户";
"BlockedUsers.BlockFormat" = "屏蔽 %@?";
"BlockedUsers.BlockTitle" = "屏蔽";
"BlockedUsers.LeavePrefix" = "离开 ";
"BlockedUsers.Info" = "被您屏蔽的用户将无法给您发送消息，或是邀请您加入群组。他们也无法看到您的头像，在线和上次上线时间。";
"BlockedUsers.AddNew" = "添加...";
"BlockedUsers.Unblock" = "取消屏蔽";

// Wallpaper
"Wallpaper.Title" = "聊天背景";
"Wallpaper.PhotoLibrary" = "照片图库";
"Wallpaper.Set" = "选用";
"Wallpaper.Wallpaper" = "背景";

// Update
"Update.Update" = "升级";

// Service
"Service.LocalizationDownloadError" = "无法下载本地化文件，请检查您的网络设置后重新尝试。";
"Service.ApplyLocalization" = "使用此本地化文件?";
"Service.ApplyLocalizationWithWarnings" = "%@\n\n使用此本地化文件?";

"Notification.SecretChatMessageScreenshot" = "%@ 截图了！";
"Notification.SecretChatScreenshot" = "已截图！";

// Broadcast Lists
"DialogList.Broadcast" = "新建广播";
"BroadcastLists.Title" = "广播列表";
"BroadcastLists.NoListsYet" = "还没有任何广播列表";
"BroadcastLists.NoListsText" = "您可以通过广播一次给多个用户发送消息。";

// Broadcast List
"BroadcastListInfo.Title" = "广播列表";
"BroadcastListInfo.AddRecipient" = "添加接受者";

// Video
"VideoPreview.OptionSD" = "普通尺寸 (%@)";
"VideoPreview.OptionHD" = "高清 (%@)";

"ChatSettings.AutoPlayAudio" = "自动播放音频";

"Settings.LogoutConfirmationTitle" = "注销?";
"Settings.LogoutConfirmationText" = "\n请注意，您可以同时在您的所有设备上登录使用 Telegram。\n\n另外，注销将会关闭所有的私密会话。";


"Login.PadPhoneHelp" = "\n您可以使用您的注册手机号在您所有的设备上登录 Telegram\n不要在此使用您 iPad SIM卡的号码，我们需要您能够接受短信\n\n确认使用此号码？\n{number}";

"Login.PadPhoneHelpTitle" = "您的手机号";

"MessageTimer.Custom" = "自定义";
"MessageTimer.Title" = "自定倒计时";

"MessageTimer.Forever" = "永远";

"MessageTimer.Seconds_1" = "%@ 秒";
"MessageTimer.Seconds_2" = "%@ 秒";
"MessageTimer.Seconds_3_10" = "%@ 秒";
"MessageTimer.Seconds_any" = "%@ 秒";
"MessageTimer.Minutes_1" = "%@ 分钟";
"MessageTimer.Minutes_2" = "%@ 分钟";
"MessageTimer.Minutes_3_10" = "%@ 分钟";
"MessageTimer.Minutes_any" = "%@ 分钟";
"MessageTimer.Hours_1" = "%@ 小时";
"MessageTimer.Hours_2" = "%@ 小时";
"MessageTimer.Hours_3_10" = "%@ 小时";
"MessageTimer.Hours_any" = "%@ 小时";
"MessageTimer.Days_1" = "%@ 天";
"MessageTimer.Days_2" = "%@ 天";
"MessageTimer.Days_3_10" = "%@ 天";
"MessageTimer.Days_any" = "%@ 天";
"MessageTimer.Weeks_1" = "%@ 周";
"MessageTimer.Weeks_2" = "%@ 周";
"MessageTimer.Weeks_3_10" = "%@ 周";
"MessageTimer.Weeks_any" = "%@ 周";
"MessageTimer.Months_1" = "%@ 个月";
"MessageTimer.Months_2" = "%@ 个月";
"MessageTimer.Months_3_10" = "%@ 个月";
"MessageTimer.Months_any" = "%@ 个月";
"MessageTimer.Years_1" = "%@ 年";
"MessageTimer.Years_2" = "%@ 年";
"MessageTimer.Years_3_10" = "%@ 年";
"MessageTimer.Years_any" = "%@ 年";

"MessageTimer.ShortSeconds_1" = "%@秒";
"MessageTimer.ShortSeconds_2" = "%@秒";
"MessageTimer.ShortSeconds_3_10" = "%@秒";
"MessageTimer.ShortSeconds_any" = "%@秒";
"MessageTimer.ShortMinutes_1" = "%@分钟";
"MessageTimer.ShortMinutes_2" = "%@分钟";
"MessageTimer.ShortMinutes_3_10" = "%@分钟";
"MessageTimer.ShortMinutes_any" = "%@分钟";
"MessageTimer.ShortHours_1" = "%@小时";
"MessageTimer.ShortHours_2" = "%@小时";
"MessageTimer.ShortHours_3_10" = "%@小时";
"MessageTimer.ShortHours_any" = "%@小时";
"MessageTimer.ShortDays_1" = "%@天";
"MessageTimer.ShortDays_2" = "%@天";
"MessageTimer.ShortDays_3_10" = "%@天";
"MessageTimer.ShortDays_any" = "%@天";
"MessageTimer.ShortWeeks_1" = "%@周";
"MessageTimer.ShortWeeks_2" = "%@周";
"MessageTimer.ShortWeeks_3_10" = "%@周";
"MessageTimer.ShortWeeks_any" = "%@周";

"Activity.UploadingPhoto" = "上传照片中";
"Activity.UploadingVideo" = "上传视频中";
"Activity.UploadingDocument" = "上传文件中";
"Activity.RecordingAudio" = "录制音频中";
"Activity.Location" = "选择位置中";

"Service.NetworkConfigurationUpdatedMessage" = "连接状态更新成功";

"Compatibility.SecretMediaVersionTooLow" = "%@ 使用的 Telegram 版本过低, 私密照片将会以兼容模式显示\n\n%@ 升级 Telegram 后，一分钟和一分钟以内倒计时的照片将会以 '按住来浏览' 显示，并且你将会在对方截图后收到提醒。";


"Contacts.GlobalSearch" = "全局搜索";
"Profile.Username" = "用户名";
"Settings.Username" = "用户名";
"Settings.UsernameEmpty" = "无";

"Username.Title" = "用户名";
"Username.Placeholder" = "您的用户名";
"Username.Help" = "您可以设定一个 **Telegram** 用户名。 如果您设定了用户名，其他用户将能够在无法获取您手机号的情况下找到并联系您\n\n你可以使用 字母, 数字以及下划线，并至少使用 **5** 个字符。";

"Username.InvalidTooShort" = "用户名至少要有 **5** 个字符";
"Username.InvalidStartsWithNumber" = "抱歉，用户名不能以数字开头";
"Username.InvalidCharacters" = "抱歉，此有用户名无效";
"Username.InvalidTaken" = "抱歉，此用户名已经被使用了";

"Username.CheckingUsername" = "检查用户名...";
"Username.UsernameIsAvailable" = "%@ 可用";

"WebSearch.Images" = "图片";
"WebSearch.GIFs" = "GIF";
"WebSearch.RecentSectionTitle" = "最近";
"WebSearch.RecentSectionClear" = "清除";
"WebSearch.RecentClearConfirmation" = "您确定要清除最近的图片？";

"Settings.PrivacySettings" = "隐私与安全";

"UserCount_1" = "1 位用户";
"UserCount_2" = "2 位用户";
"UserCount_3_10" = "%@ 位用户";
"UserCount_any" = "%@ 位用户";

"PrivacySettings.Title" = "隐私与安全";

"PrivacySettings.PrivacyTitle" = "隐私";
"PrivacySettings.LastSeen" = "上次上线";
"PrivacySettings.LastSeenEverybody" = "所有人";
"PrivacySettings.LastSeenContacts" = "我的联系人";
"PrivacySettings.LastSeenNobody" = "不展示";

"PrivacySettings.LastSeenEverybodyMinus" = "所有人 (-%@)";
"PrivacySettings.LastSeenContactsPlus" = "我的联系人 (+%@)";
"PrivacySettings.LastSeenContactsMinus" = "我的联系人 (-%@)";
"PrivacySettings.LastSeenContactsMinusPlus" = "我的联系人 (-%@, +%@)";
"PrivacySettings.LastSeenNobodyPlus" = "不展示 (+%@)";

"PrivacySettings.SecurityTitle" = "安全";

"PrivacySettings.DeleteAccountTitle" = "删除账户";
"PrivacySettings.DeleteAccountIfAwayFor" = "如果离开";
"PrivacySettings.DeleteAccountHelp" = "如果您在此期限期限内一次都没有登录您的帐号，您账户的所有资料 包括群组，消息记录以及联系人都会被删除。";
"PrivacySettings.DeleteAccountNowConfirmation" = "删除账户？";
"PrivacySettings.DeleteAccountNever" = "永不";

"PrivacyLastSeenSettings.Title" = "上次上线";
"PrivacyLastSeenSettings.LastSeenHelp" = "设置谁可以看到您的上次上线时间。";
"PrivacyLastSeenSettings.CustomHelp" = "注意：对于您设置为无法看到您上次上线时间的人，您也无法看到他们的详细上次上线时间。 他们的上次上线时间将会会用一个大约值来代替 (最近曾上线, 上次上线于一周内, 上次上线于一个月内)。";
"PrivacyLastSeenSettings.AlwaysShareWith" = "总是对他们公开...";
"PrivacyLastSeenSettings.NeverShareWith" = "不对他们公开...";
"PrivacyLastSeenSettings.CustomShareSettingsHelp" = "这些设置将会优先于上边的设置。";

"PrivacyLastSeenSettings.CustomShareSettings.Delete" = "删除";
"PrivacyLastSeenSettings.AlwaysShareWith.Title" = "总是公开";
"PrivacyLastSeenSettings.AlwaysShareWith.Placeholder" = "总是公开给...";
"PrivacyLastSeenSettings.NeverShareWith.Title" = "不对他们公开";
"PrivacyLastSeenSettings.NeverShareWith.Placeholder" = "不对他们公开...";
"PrivacyLastSeenSettings.EmpryUsersPlaceholder" = "添加用户";
"PrivacyLastSeenSettings.AddUsers_1" = "添加 1 位用户到此列表？";
"PrivacyLastSeenSettings.AddUsers_2" = "添加 2 位用户到此列表？";
"PrivacyLastSeenSettings.AddUsers_3_10" = "添加 %@ 位用户到此列表？";
"PrivacyLastSeenSettings.AddUsers_any" = "添加 %@ 位用户到此列表？";

"PrivacySettings.FloodControlError" = "抱歉，请求过于频繁。 暂时无法修改隐私设置，请稍后再试。";

"Settings.PhoneNumber" = "电话号码";

"PhoneNumberHelp.Help" = "您可以在这里更改绑定到 Telegram 的电话号码。您的账号和所有云端数据——消息、多媒体、联系人等都将被移动到新的号码当中。\n\n**注意：** 所有拥有您老号码且未被屏蔽的 Telegram 联系人将即时获取到您的**新号码**。";
"PhoneNumberHelp.Alert" = "所有拥有您老号码且未被屏蔽的 Telegram 联系人将即时获取到您的新号码。";
"PhoneNumberHelp.ChangeNumber" = "更改号码";

"ChangePhoneNumberNumber.Title" = "更改号码";
"ChangePhoneNumberNumber.NewNumber" = "新号码";
"ChangePhoneNumberNumber.Help" = "我们将发送验证码短信到您的新号码中。";
"ChangePhoneNumberNumber.NumberPlaceholder" = "输入您的新手机号码";

"ChangePhoneNumberCode.Code" = "验证码";
"ChangePhoneNumberCode.CodePlaceholder" = "输入验证码";
"ChangePhoneNumberCode.Help" = "我们已向您发送验证码短信。";
"ChangePhoneNumberCode.CallTimer" = "Telegram 将会在 %@ 内呼叫您的手机";
"ChangePhoneNumberCode.RequestingACall" = "正在请求一个语音呼叫...";
"ChangePhoneNumberCode.Called" = "Telegram 已拨通您的电话";

"QuickSend.Photos_1" = "发送 1 个照片";
"QuickSend.Photos_2" = "发送 2 个照片";
"QuickSend.Photos_3_10" = "发送 %@ 个照片";
"QuickSend.Photos_any" = "发送 %@ 个照片";
